<?php 

add_filter( 'widget_tag_cloud_args', 'change_tag_cloud_font_sizes');

function change_tag_cloud_font_sizes( array $args ) {
    $args ['default'] = '1.5'; //розмір по замовчуванню
    $args['smallest'] = '1.5'; //найменший розмір (коли до немає жодного поста прикріпленого до тегу
    $args['largest'] = '1.5'; // найбільший розмір, коли до тегу прикріплений 1 пост або більше, воно саме відносно вираховує
    $args ['unit'] = 'rem'; //одиниці виміру
    //зробила всы однакові, а можна було 0.8, 1, 1.3 чи будь-які інші значення, також працює якщо лінкам призначити фонт-сайз - 1.5 з імпотант!

    return $args;
}